In [ ]:
import matplotlib.pyplot as plt
import pandas as pd

In [5]:
# load data set
titanic=pd.read_csv('train.csv')

In [8]:
# Headers of dataset
titanic.head

<bound method NDFrame.head of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

In [9]:
# show the size of data set
titanic.size

10692

In [12]:
# show the description of data set
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
titanic.shape

(891, 12)

In [11]:
# print all the column in data set
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
# find mean,max of particular column
print(titanic['Fare'].mean())

32.2042079685746

In [15]:
# Average Fare Prize
print(round(titanic['Fare'].mean(),2))

32.2

In [16]:
# Highest Fare
print(titanic['Fare'].max())

512.3292

In [18]:
# Minimum Fare
print(titanic['Fare'].min())

0.0

In [21]:
# Find the Maximum Age
print(titanic['Age'].max())

80.0

In [ ]:
# add new column in data set

In [ ]:
# drop a column from data set

In [ ]:
# count the total value of a column

In [ ]:
# count the passanger classwise

In [ ]:
# count the survived passanger of class 3 and they paid fair having sex=male.